# IFCTransaction Class

---
IFC transactions are context-like objects that guard any changes made to an IFC file.
SystemObject Autodesk.Revit.DB.IFCIFCTransaction
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

    public class IFCTransaction : IDisposable

    Public Class IFCTransaction
    	Implements IDisposable

    public ref class IFCTransaction : IDisposable

    type IFCTransaction =
        class
            interface IDisposable
        end
The IFCTransaction type exposes the following members.
| Name| Description
---|---|---
| IFCTransaction|  Instantiates a transaction object.
Top
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
| Name| Description
---|---|---
| Commit|  Commits all changes made to the IFC file during the transaction.
| Dispose| Releases all resources used by the IFCTransaction
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| RollBack|  Rolls back all changes made to the IFC file during the transaction.
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
Any change to an IFC file can only be made while there is an active transaction open for that file. Changes do not become a part of the file until the active transaction is committed. Consequently, all changes made in a transaction can be rolled back either explicitly or implicitly (by the destructor).
#### Reference
Autodesk.Revit.DB.IFC Namespace